{
  "name": "EPSDKMasonry",
  "version": "1.1.0",
  "license": {
    "type": "MIT",
    "text": "Copyright (c) 2023 Beijing Elex Technology Co., Ltd.\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
  },
  "summary": "Harness the power of Auto Layout NSLayoutConstraints with a simplified, chainable and expressive syntax.",
  "homepage": "https://github.com/cloudkite/Masonry",
  "authors": {
    "Jonas Budelmann": "jonas.budelmann@gmail.com"
  },
  "social_media_url": "http://twitter.com/cloudkite",
  "source": {
    "http": "http://cocoapods.elex-tech.com/releases/EPSDKMasonry/1.1.0/EPSDKMasonry_1.1.0_a560.zip",
    "type": "zip"
  },
  "description": "Masonry is a light-weight layout framework which wraps AutoLayout with a nicer syntax.\nMasonry has its own layout DSL which provides a chainable way of describing your\nNSLayoutConstraints which results in layout code which is more concise and readable.\n    Masonry supports iOS and Mac OSX.",
  "ios": {
    "frameworks": [
      "Foundation",
      "UIKit"
    ]
  },
  "tvos": {
    "frameworks": [
      "Foundation",
      "UIKit"
    ]
  },
  "osx": {
    "frameworks": [
      "Foundation",
      "AppKit"
    ]
  },
  "platforms": {
    "ios": "6.0"
  },
  "requires_arc": true,
  "vendored_frameworks": "EPSDKMasonry.framework"
}
